# Программа запрашивает у пользователя строку чисел, разделенных пробелом.
# При нажатии Enter должна выводиться сумма чисел.
# Пользователь может продолжить ввод чисел, разделенных пробелом и снова нажать Enter.
# Сумма вновь введенных чисел будет добавляться к уже подсчитанной сумме.
# Но если вместо числа вводится специальный символ, выполнение программы завершается.
# Если специальный символ введен после нескольких чисел,
# то вначале нужно добавить сумму этих чисел к полученной ранее сумме и после этого завершить программу.


def str_to_sum(str):
    # Функция вычисляет сумму чисел, переданных строкой с пробелами

    res = str.split()

    if 'end' in res:
        res.remove('end')

    for i in range(len(res)):
        res[i] = int(res[i])
    return sum(res)


answer = ''
summ = 0
while True:
    answer = input('Введите числа через пробел (enter для суммирования, end для завершения): ')
    summ += str_to_sum(answer)
    print(summ)
    if answer.find('end') != -1:
        break
