# 1. Реализовать функцию, принимающую два числа (позиционные аргументы) и выполняющую их деление.
# Числа запрашивать у пользователя, предусмотреть обработку ситуации деления на ноль.


def division(num1, num2):
    # Функция деления 1 числа на второе

    if num2 != 0:
        return round((num1 / num2), 2)
    else:
        return 'Не надо делить на ноль'


num1 = float(input('Введите первое число: '))
num2 = float(input('Введите второе число: '))
print(division(num1, num2))
