# 4. Программа принимает действительное положительное число x и целое отрицательное число y.
# Необходимо выполнить возведение числа x в степень y.
# Задание необходимо реализовать в виде функции my_func(x, y).
# При решении задания необходимо обойтись без встроенной функции возведения числа в степень.
# Подсказка: попробуйте решить задачу двумя способами.
# Первый — возведение в степень с помощью оператора **.
# Второй — более сложная реализация без оператора **, предусматривающая использование цикла.


def my_func(x, y):
    # Функция возводит x в y

    return x ** y


def true_funk(x, y):
    # Функция возводит x в y через цикл

    res = 1
    for i in range(-y):
        res *= x

    return 1 / res


print(my_func(10, -2))
print(true_funk(10, -2))
