# 2. Для списка реализовать обмен значений соседних элементов, т.е.
# Значениями обмениваются элементы с индексами 0 и 1, 2 и 3 и т.д.
# При нечетном количестве элементов последний сохранить на своем месте.
# Для заполнения списка элементов необходимо использовать функцию input().

# lst = [1, 2, 3, 4, 5, 6, 7, 8, 9, 0]

# Ввод данных
lst = []
while True:
    answer = input('Введите следующий элемент списка (end, чтобы закончить): ')
    if answer == 'end':
        break
    else:
        lst.append(answer)

print(lst)

# Обмен позиций соседями
i = 0
while i < len(lst) - 1:
    lst[i], lst[i + 1] = lst[i + 1], lst[i]
    i += 2

print(lst)
