# 3. Пользователь вводит месяц в виде целого числа от 1 до 12.
# Сообщить к какому времени года относится месяц (зима, весна, лето, осень).
# Напишите решения через list и через dict.

month = int(input('Введите номер месяца (1-12): '))

months = {1: 'зима', 2: 'зима', 3: 'весна', 4: 'весна', 5: 'весна', 6: 'лето',
           7: 'лето', 8: 'лето', 9: 'осень', 10: 'осень', 11: 'осень', 12: 'зима'}
year_time = months.get(month)

months_lst = ['зима', 'зима', 'весна', 'весна', 'весна', 'лето',
               'лето', 'лето', 'осень', 'осень', 'осень', 'зима']
year_time_from_list = months_lst[month - 1]

print(year_time)
print(year_time_from_list)
