# 4. Пользователь вводит целое положительное число.
# Найдите самую большую цифру в числе.
# Для решения используйте цикл while и арифметические операции.

number = int(input('Введите число: '))

max_digit = 0

while number > 0:
    cur_digit = number % 10  # берем правую цифру на анализ
    if max_digit < cur_digit:
        max_digit = cur_digit
    number //= 10  # исключаем правую цифру после анализа

print(f'Самая большая цифра: {max_digit}')
