# Создать класс TrafficLight (светофор) и определить у него один атрибут color (цвет) и метод running (запуск).
# Атрибут реализовать как приватный. В рамках метода реализовать переключение светофора в режимы: красный, желтый, зеленый.
# Продолжительность первого состояния (красный) составляет 7 секунд, второго (желтый) — 2 секунды, третьего (зеленый) — на ваше усмотрение.
# Переключение между режимами должно осуществляться только в указанном порядке (красный, желтый, зеленый).
# Проверить работу примера, создав экземпляр и вызвав описанный метод.
# Задачу можно усложнить, реализовав проверку порядка режимов, и при его нарушении выводить соответствующее сообщение и завершать скрипт.

from time import sleep


class TrafficLight:

    def __init__(self):
        self.__color = 'красный'  # новый светофор по умолнчанию загорается краснным

    def running(self, _changes_count):

        print('Светофор включился')

        for i in range(_changes_count):
            if self.__color == 'красный':
                print(self.__color)
                sleep(7)
                self.__color = 'желтый'
                i += 1
            elif self.__color == 'желтый':
                print(self.__color)
                sleep(2)
                self.__color = 'зеленый'
                i += 1
            elif self.__color == 'зеленый':
                print(self.__color)
                sleep(4)
                self.__color = 'красный'
                i += 1
            else:
                print('Нет такого цвета, светофор выключился')
                break


cnt = int(input('Сколько раз светофору переключиться? '))
tl = TrafficLight()
tl.running(cnt)
