# 1. Создать список и заполнить его элементами различных типов данных.
# Реализовать скрипт проверки типа данных каждого элемента.
# Использовать функцию type() для проверки типа.
# Элементы списка можно не запрашивать у пользователя, а указать явно, в программе.

lst = [1, 2.01, 3 + 1j, 'привет', True, None, [1, 2],
       (3, 4), {1: 2, 3: 4}, b'hello', bytearray(b'hello')]

for i in lst:
    print(type(i))
