# 4. Пользователь вводит строку из нескольких слов, разделённых пробелами.
# Вывести каждое слово с новой строки. Строки необходимо пронумеровать.
# Если в слово длинное, выводить только первые 10 букв в слове.

str = input('Введите слова через пробел: ')
lst = str.split()

for index, elem in enumerate(lst):
    print(index + 1, elem[:10])
