# 5. Реализовать структуру «Рейтинг», представляющую собой не возрастающий набор натуральных чисел.
# У пользователя необходимо запрашивать новый элемент рейтинга.
# Если в рейтинге существуют элементы с одинаковыми значениями,
# то новый элемент с тем же значением должен разместиться после них.

lst = [7, 5, 3, 3, 3.0, 2]
new = int(input('Введите новый элемент: '))

# поиск элемента, справа от которого нужно вставить новый
left = 0
for item in lst:
    if item >= new:
        left = item

if left == 0:  # если элемент левее не нашелся
    lst.insert(0, new)
else:  # если элемент левее нашелся
    pos_first = lst.index(left) + 1  # узнаем позицию для вставки нового
    offset = 0
    piece = lst[pos_first:]  # поищем дубликаты вставляемого элемента
    for item in piece:
        if item == new:
            offset += 1  # получим сдвиг вправо

    pos_new = pos_first + offset
    lst.insert(pos_new, new)

print(lst)
