# 6. Спортсмен занимается ежедневными пробежками. В первый день его результат составил a километров.
# Каждый день спортсмен увеличивал результат на 10 % относительно предыдущего.
# Требуется определить номер дня, на который общий результат спортсмена составить не менее b километров.
# Программа должна принимать значения параметров a и b и выводить одно натуральное число — номер дня.

a = int(input('Введите а (результат за первый день): '))
b = int(input('Введите b (целевой результат): '))

day_number = 1
result = a

while result < b:
    result *= 1.1
    day_number += 1

print(day_number)
